### <font color=blue> Ques 05: </font>  <font color=red>  How do I `remove columns / rows` from a pandas dataframe? </font>

In [1]:
import pandas as pd
ufo_ds = pd.read_csv('http://bit.ly/uforeports')
ufo_ds.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [2]:
ufo_ds.shape

(18241, 5)

In [3]:
ufo_ds.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [4]:
# We will drop the column : "Colors Reported"
# axis = 0 means row 
# axis = 1 means column

ufo_ds.drop('Colors Reported', axis=1, inplace=True)

In [5]:
ufo_ds.columns

Index(['City', 'Shape Reported', 'State', 'Time'], dtype='object')

In [6]:
ufo_ds.head(3)

          City Shape Reported State             Time
0       Ithaca       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro          OTHER    NJ  6/30/1930 20:00
2      Holyoke           OVAL    CO  2/15/1931 14:00

In [7]:
# Drop multiple columns
ufo_ds.drop(['City','Time'], axis=1, inplace=True)

In [8]:
ufo_ds.head(3)

  Shape Reported State
0       TRIANGLE    NY
1          OTHER    NJ
2           OVAL    CO

> #### Removing rows :

In [9]:

ufo_ds.drop([0, 1] , axis = 0, inplace = True)   # Index no of the rows

ufo_ds.head()

  Shape Reported State
2           OVAL    CO
3           DISK    KS
4          LIGHT    NY
5           DISK    ND
6         CIRCLE    CA